export const itemText = {
  돌격조끼: "특수방어가 1.5배 올라가지만 변화 기술을 쓸 수 없게 된다.",
  생명의구슬: "공격할 때마다 HP가 10%씩 깎이지만 기술의 위력이 1.3배 올라간다.",
  기합의띠: "체력이 가득찬 상태일 때 기절할 정도의 데미지를 입어도 체력 1을 남기고 버틴다.",
  녹슨검: "먼 옛날의 영웅이 재앙을 막는 데 사용했다고 전해지는 검.",
  녹슨방패: "먼 옛날의 영웅이 재앙을 막는 데 사용했다고 전해지는 방패.",
  구애스카프: "지니게 하면 스피드를 50% 상승시키지만 처음 선택한 기술밖에 쓸 수 없다.",
  구애안경: "지니게 하면 특수공격이 50% 올라가지만 처음 사용한 기술밖에 쓸 수 없다.",
  구애머리띠: "지니게 하면 공격이 50% 올라가지만 처음 사용한 기술밖에 쓸 수 없다.",
  통굽부츠: "이 도구를 지닌 포켓몬은 필드에 설치되어 있는 설치기의 효과를 무시한다.",
  화염구슬: "지니게 하면 배틀 중에 화상 상태가 된다.",
  먹다남은음식: "이 도구를 지니게 한 포켓몬은 매턴 최대 HP의 1/16만큼 회복한다.",
  자뭉열매: "체력이 절반 이하로 떨어질 경우 체력의 1/4만큼 회복한다.",
  울퉁불퉁멧: "타격기술을 받을 때 상대방에게 체력의 1/6 데미지를 준다.",
  부스트에너지: "에너지가 가득한 캡슐. 어떤 특성을 가진 포켓몬에게 지니게 하면 그 힘을 증폭시킨다.",
  펀치글러브: "지니게 하면 펀치 기술의 위력이 오르고 상대에게 접촉하지 않는 펀치가 된다.",
};

export const noNullItem = ["녹슨검", "녹슨방패"]; //탁떨, 트릭 적용 안되는 아이템
