import BattlePokemon from "./PokemonCustom";
//배틀용 포켓몬 객체
//원본(PokemonOriginal)에서 노력치, 스킬, 지닌 도구를 설정한다
//ReadOnly, 불변값으로 Pokemon 객체가 origin으로 지니고있는다
// prettier-ignore
class BattlePokemonRepository {
  constructor() {
    this.items = [

new BattlePokemon("0130-1", "0130", "6V", 244, 0, 252, 0, 0, 12, "def", "catk",  // 갸라도스
  "폭포오르기", "지진", "도발", "전기자석파", "울퉁불퉁멧", "위협"),

new BattlePokemon("0145-1", "0145", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",  // 썬더
  "10만볼트", "열풍", "폭풍", "날개쉬기", "생명의구슬", "정전기"),

new BattlePokemon("0149-1", "0149", "6V", 196, 252, 4, 0, 4, 52, "atk", "catk",  // 망나뇽
  "신속", "역린", "지진", "아이언헤드", "구애머리띠", "멀티스케일"),

new BattlePokemon("0250-1", "0250", "6V", 252, 36, 76, 0, 92, 52, "atk", "catk",   // 칠색조
  "성스러운불꽃", "브레이브버드", "지진", "HP회복", "통굽부츠", "재생력"),

new BattlePokemon("0382-1", "0382", "5V1A", 0, 0, 4, 252, 0, 252, "catk", "atk",    // 가이오가
  "해수스파우팅", "근원의파동", "번개", "냉동빔", "구애스카프", "잔비"),

new BattlePokemon("0497-1", "0497", "5V1A", 84, 0, 164, 4, 4, 252, "speed", "atk",    // 샤로다
  "리프스톰", "뱀눈초리", "씨뿌리기", "대타출동", "먹다남은음식", "심술꾸러기"),

new BattlePokemon("0644-1", "0644", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",    // 블랙큐레무
  "고드름침", "크로스썬더", "용의춤", "스케일샷", "속임수주사위", "테라볼티지"),

new BattlePokemon("0645-1", "0645", "6V", 212, 4, 252, 0, 4, 36, "def", "catk",    // 랜드로스
  "지진", "유턴", "스텔스록", "암석봉인", "울퉁불퉁멧", "위협"),

new BattlePokemon("0778-1", "0778", "5V1A", 4, 252, 0, 0, 0, 252, "speed", "atk",  // 따라큐
  "야습", "칼춤", "섀도크루", "치근거리기", "생명의구슬", "탈"),

new BattlePokemon("0812-1", "0812", "6V", 252, 0, 4, 0, 252, 0, "cdef", "catk",  //고릴타
  "드럼어택", "그래스슬라이더", "탁쳐서떨구기", "유턴", "돌격조끼", "그래스메이커"),

new BattlePokemon("0815-1", "0815", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",  //에이스번
  "화염볼", "무릎차기", "기습", "칼춤", "생명의구슬", "리베로"),

new BattlePokemon("0888-1", "0888", "6V", 140, 84, 4, 0, 28, 252, "speed", "catk",  // 자시안
  "거수참", "치근거리기", "칼춤", "인파이트", "녹슨검", "불요의검"),

new BattlePokemon("0889-1", "0889", "6V", 252, 36, 76, 0, 92, 52, "def", "catk",   // 자마젠타
  "거수탄", "바디프레스", "철벽", "깨물어부수기", "녹슨방패", "불굴의방패"),

new BattlePokemon("0890-1", "0890", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",  // 무한다이노
  "다이맥스포", "오물웨이브", "화염방사", "섀도볼", "생명의구슬", "프레셔"),

new BattlePokemon("0892-1", "0892", "6V", 124, 236, 4, 0, 4, 140, "atk", "catk",  // 물라오스
  "수류연타", "아쿠아제트", "인파이트", "칼춤", "펀치글러브", "보이지않는주먹"),

new BattlePokemon("0896-1", "0896", "4V", 252, 252, 4, 0, 0, 0, "atk", "speed",  // 백마렉스
  "블리자드랜스", "10만마력", "트릭룸", "칼춤", "먹다남은음식", "혼연일체(백)"),

new BattlePokemon("0897-1", "0897", "5V1A", 0, 0, 4, 252, 0, 252, "catk", "atk",  // 흑마렉스
  "아스트랄비트", "사이코쇼크", "트릭", "나쁜음모", "구애스카프", "혼연일체(흑)"),

new BattlePokemon("0901-1", "0901", "6V", 204, 252, 28, 0, 20, 4, "atk", "catk", // 다투곰
  "지진", "객기", "개척하기", "칼춤", "화염구슬", "근성"),

new BattlePokemon("0902-1", "0902", "5V1A", 212, 0, 4, 196, 4, 92, "catk", "atk", // 달투곰
  "블러드문", "하이퍼보이스", "대지의힘", "진공파", "돌격조끼", "심안"),

new BattlePokemon("0977-1", "0977", "6V", 252, 0, 252, 4, 0, 0, "def", "catk",   // 어써러셔
  "땅가르기", "방어", "하품", "웨이브태클", "먹다남은음식", "천진"),

new BattlePokemon("0987-1", "0987", "5V1A", 132, 0, 4, 236, 4, 132, "catk", "atk",   // 날개치는머리
  "문포스", "병상첨병", "전기자석파", "도발", "부스트에너지", "고대활성"),

new BattlePokemon("1002-1", "1002", "6V", 0, 188, 68, 0, 0, 252, "speed", "catk", //파이젠
  "고드름떨구기", "기습", "성스러운칼", "얼음뭉치", "기합의띠", "재앙의검"),

new BattlePokemon("1003-1", "1003", "6V", 252, 0, 252, 0, 4, 0, "def", "catk",  //딩루
  "지진", "카타스트로피", "스텔스록", "날려버리기", "자뭉열매", "재앙의그릇"),

new BattlePokemon("1004-1", "1004", "5V1A", 4, 0, 0, 252, 0, 252, "catk", "atk",  //위유이
  "불대문자", "화염방사", "오버히트", "악의파동", "구애스카프", "재앙의구슬"),

new BattlePokemon("1007-1", "1007", "6V", 0, 252, 4, 0, 0, 252, "speed", "catk",  //코라이돈
  "플레어드라이브", "인파이트", "유턴", "역린", "구애스카프", "진홍빛고동"),

new BattlePokemon("1008-1", "1008", "5V1A", 44, 0, 4, 244, 12, 204, "catk", "atk",  //미라이돈
  "라이트닝드라이브", "볼트체인지", "용성군", "매지컬샤인", "구애안경", "하드론엔진"),
  
// 체력 공격력 방어력 특공 특방 스피드
    ];
  }
  // ID로 객체 찾기
  getItemById(id) {
    return this.items.find((item) => item.id === id) || null;
  }
}

// 싱글턴 객체 생성 (전역에서 사용 가능)
const bpr = new BattlePokemonRepository();
export default bpr;
