import { josa } from "josa";
class Pokemon {
  // 포켓몬 원본 객체
  // ReadOnly, 불변값
  constructor(no, id, name, total, hp, atk, def, catk, cdef, speed, type1, type2, feature, abilList) {
    if (Array.isArray(feature)) {
      abilList = feature;
      feature = undefined;
    }
    // prettier-ignore
    this._validateParams(id, name, total, hp, atk, def, catk, cdef, speed, type1, type2, feature, abilList);
    this.no = no;
    this.id = id;
    this.name = name;
    this.names = josa(`${name}#{은}`);
    this.namess = josa(`${name}#{을}`);
    this.hp = hp;
    this.atk = atk;
    this.def = def;
    this.catk = catk;
    this.cdef = cdef;
    this.speed = speed;
    this.type1 = type1;
    this.type2 = type2;
    this.feature = feature;
    this.abilList = abilList || [];
  }
  // prettier-ignore
  _validateParams(id, name, total, hp, atk, def, catk, cdef, speed, type1, type2, feature, abilList){
    if (typeof id !== "string") console.error("id must be a string", id);
    if (typeof name !== "string") console.error("name must be a string", name);
    if (typeof total !== "number")
      console.error("total must be a number", total);
    if (typeof hp !== "number") console.error("hp must be a number", hp);
    if (typeof atk !== "number") console.error("atk must be a number", atk);
    if (typeof def !== "number") console.error("def must be a number", def);
    if (typeof catk !== "number") console.error("catk must be a number", catk);
    if (typeof cdef !== "number") console.error("cdef must be a number", cdef);
    if (typeof speed !== "number")
      console.error("speed must be a number", speed);
    if (hp + atk + def + catk + cdef + speed !== total) {
      console.error(id + "종족치오류");
    }
    if (typeof type1 !== "string")
      console.error("type1 must be a string", type1);
    if (type2 !== null && typeof type2 !== "string")
      console.error("type2 must be a string or null", type2);
    if (feature !== undefined && typeof feature !== "object")
      console.error("feature must be an object or undefined", feature);
    if (abilList !== undefined && !Array.isArray(abilList))
      console.error("abilList must be an array or undefined", abilList);
  }
}
// prettier-ignore
class PokemonRepository {
  constructor() {
    this.items = [
      //     도감번호, 아이디  이름  총종족값 HP 공격 방어 특공 특방 스피드 (나무위키순)
new Pokemon("0006", "0006", "리자몽", 534, 78, 84, 78, 109, 85, 100, "불꽃", "비행", ["맹화","선파워"]),
new Pokemon("0006", "0006-x", "메가리자몽X", 634, 78, 130, 111, 130, 85, 100, "불꽃", "드래곤", ["단단한발톱"]),
new Pokemon("0006", "0006-y", "메가리자몽Y", 634, 78, 104, 78, 159, 115, 100, "불꽃", "비행", ["가뭄"]),
new Pokemon("0059", "0059", "윈디", 555, 90, 110, 80, 100,80, 95, "불꽃", null, ["위협","타오르는불꽃","정의의마음"]),
new Pokemon("0091", "0091", "파르셀", 525, 50, 95, 180, 85, 45, 70, "물", "얼음", ["조가비갑옷","스킬링크","방진"]),
new Pokemon("0113", "0113", "럭키", 450, 250, 5, 5, 35, 105, 50, "노말", null, {evo: true}, ["자연회복","하늘의은총","치유의마음"]),
new Pokemon("0121", "0121", "아쿠스타", 520, 60, 75, 85, 100, 85, 115, "물", "에스퍼", ["발광","자연회복","분석"]),
new Pokemon("0121", "0121-m", "메가아쿠스타", 620, 60, 155, 95, 90, 95, 125, "물", "에스퍼", ["천하장사"]),
new Pokemon("0130", "0130", "갸라도스", 540, 95, 125, 79, 60, 100, 81, "물", "비행", ["위협","자기과신"]),
new Pokemon("0145", "0145", "썬더", 580, 90, 90, 85, 125, 90, 100, "전기", "비행", ["프레셔","정전기"]),
new Pokemon("0149", "0149", "망나뇽", 600, 91, 134, 95, 100, 100, 80, "드래곤", "비행", ["정신력","멀티스케일"]),
new Pokemon("0184", "0184", "마릴리", 420, 100, 50, 80, 60, 80, 50, "물", "페어리", ["두꺼운지방","천하장사","초식"]),
new Pokemon("0197", "0197", "블래키", 525, 95, 65, 110, 60, 130, 65, "악", null, ["싱크로","정신력"]),
new Pokemon("0205", "0205", "쏘콘", 465, 75, 90, 140, 60, 60, 40, "벌레", "강철", ["옹골참","방진"]),
new Pokemon("0227", "0227", "무장조", 465, 65, 80, 140, 40, 70, 70, "강철", "비행", ["옹골참","날카로운눈","깨어진갑옷"]),
new Pokemon("0227", "0227-m", "메가무장조", 565, 65, 130, 150, 40, 90, 90, "강철", "비행", ["굳건한신념"]),
new Pokemon("0233", "0233", "폴리곤2", 515, 85, 80, 90, 105, 95, 60, "노말", null, {evo: true}, ["트레이스","다운로드","애널라이즈"]),
new Pokemon("0242", "0242", "해피너스", 540, 255, 10, 10, 75, 135, 55, "노말", null, ["자연회복","하늘의은총","치유의마음"]),
new Pokemon("0248", "0248", "마기라스", 600, 100, 134, 110, 95, 100, 61, "바위", "악", ["모래날림","긴장감"]),
new Pokemon("0248", "0248-m", "메가마기라스", 700, 100, 164, 150, 95, 120, 71, "바위", "악", ["모래날림"]),
new Pokemon("0250", "0250", "칠색조", 680, 106, 130, 90, 110, 154, 90, "불꽃", "비행", { legendary: true }, ["프레셔","재생력"]),
new Pokemon("0260", "0260", "대짱이", 535, 100, 110, 90, 85, 90, 60, "물", "땅", ["급류","습기"]),
new Pokemon("0260", "0260-m", "메가대짱이", 635, 100, 150, 110, 95, 110, 70, "물", "땅", ["쓱쓱"]),
new Pokemon("0279", "0279", "패리퍼", 440, 60, 50, 100, 95, 70, 65, "물", "비행", ["잔비","날카로운눈","젖은접시"]),
new Pokemon("0303", "0303", "입치트", 380, 50, 85, 85, 55, 55, 50, "강철", "페어리", ["위협","괴력집게","우격다짐"]),
new Pokemon("0303", "0303-m", "메가입치트", 480, 50, 105, 125, 55, 95, 50, "강철", "페어리", ["천하장사"]),
new Pokemon("0324", "0324", "코터스", 470, 70, 85, 140, 85, 70, 20, "불꽃", null, ["가뭄","하얀연기","조개갑옷"]),
new Pokemon("0373", "0373", "보만다", 600, 95, 135, 80, 110, 80, 100, "드래곤", "비행", ["위협","자기과신"]),
new Pokemon("0373", "0373-m", "메가보만다", 700, 95, 145, 130, 120, 90, 120, "드래곤", "비행", ["스카이스킨"]),
new Pokemon("0376", "0376", "메타그로스", 600, 80, 135, 130, 95, 90, 70, "강철", "에스퍼", ["클리어바디","라이트메탈"]),
new Pokemon("0376", "0376-m", "메가메타그로스", 700, 80, 145, 150, 105, 110, 110, "강철", "에스퍼", ["단단한발톱"]),
new Pokemon("0382", "0382", "가이오가", 670, 100, 100, 90, 150, 140, 90, "물", null, { legendary: true }, ["잔비"]),
new Pokemon("0398", "0398", "찌르호크", 485, 85, 120, 70, 50, 60, 100, "노말", "비행", ["위협","이판사판"]),
new Pokemon("0445", "0445", "한카리아스", 600, 108, 130, 95, 80, 85, 102, "드래곤", "땅", ["까칠한피부","모래숨기"]),
new Pokemon("0450", "0450", "하마돈", 525, 108, 112, 118, 68, 72, 47, "땅", null, ["모래날림","모래헤치기"]),
new Pokemon("0473", "0473", "맘모꾸리", 530, 110, 130, 80, 70, 60, 80, "얼음", "땅", ["두꺼운지방","둔감","눈숨기"]),
new Pokemon("0479", "0479-w", "워시로토무", 520, 50, 65, 107, 105, 107, 86, "전기", "물", ["부유"]),
new Pokemon("0479", "0479-h", "히트로토무", 520, 50, 65, 107, 105, 107, 86, "전기", "불꽃", ["부유"]),
new Pokemon("0479", "0479-c", "커트로토무", 520, 50, 65, 107, 105, 107, 86, "전기", "풀", ["부유"]),
new Pokemon("0485", "0485", "히드런", 600, 91, 90, 106, 130, 106, 77, "불꽃", "강철", ["타오르는불꽃","불꽃몸"]),
new Pokemon("0488", "0488", "크레세리아", 580, 120, 70, 110, 75, 120, 85, "에스퍼", null, ["부유"]),
new Pokemon("0497", "0497", "샤로다", 528, 75, 75, 95, 75, 95, 113, "풀", null, ["심술꾸러기","심록"]),
new Pokemon("0503", "0503-b", "히검귀", 528, 90, 108, 80, 100, 65, 85, "물", "악", ["예리함","급류"]),
new Pokemon("0530", "0530", "몰드류", 508, 110, 135, 60, 50, 65, 88, "땅", "강철", ["틀깨기","모래헤치기","모래의힘"]),
new Pokemon("0594", "0594", "맘복치", 470, 165, 75, 80, 40, 45, 65, "물", null, ["재생력","쓱쓱","치유의마음"]),
new Pokemon("0596", "0596", "전툴라", 472, 70, 77, 60, 97, 60, 108, "벌레", "전기", ["복안","긴장감","벌레의알림"]),
new Pokemon("0598", "0598", "너트령", 489, 74, 94, 131, 54, 116, 20, "풀", "강철", ["철가시","위험예지"]),
new Pokemon("0609", "0609", "샹델라", 520, 60, 55, 90, 145, 90, 80, "고스트", "불꽃", ["타오르는불꽃","불꽃몸","틈새포착"]),
new Pokemon("0635", "0635", "삼삼드래", 600, 92, 105, 90, 125, 90, 98, "악", "드래곤", ["부유"]),
new Pokemon("0645", "0645", "랜드로스", 600, 89, 145, 90, 105, 80, 91, "땅", "비행", ["위협"]),
new Pokemon("0646", "0646-a", "블랙큐레무", 700, 125, 170, 100, 120, 90, 95, "드래곤", "얼음", { legendary: true }, ["테라볼티지"]),
new Pokemon("0663", "0663", "파이어로", 499, 78, 81, 71, 74, 69, 126, "불꽃", "비행", ["질풍날개","불꽃몸"]),
new Pokemon("0697", "0697", "견고라스", 521, 82, 121, 119, 69, 59, 71, "바위", "드래곤", ["옹골찬턱","돌머리"]),
new Pokemon("0713", "0713", "크레베이스", 514, 95, 117, 184, 44, 46, 28, "얼음", null, ["옹골참","옹골찬턱","아이스바디"]),
new Pokemon("0716", "0716", "제르네아스", 680, 126, 131, 95, 131, 98, 99, "페어리", null, { legendary: true }, ["페어리오라"]),
new Pokemon("0717", "0717", "이벨타르", 680, 126, 131, 95, 131, 98, 99, "악", "비행", { legendary: true }, ["다크오라"]),
new Pokemon("0730", "0730", "누리레느", 530, 80, 74, 74, 126, 116, 60, "물", "페어리", ["급류","촉촉보이스"]),
new Pokemon("0752", "0752", "깨비물거미", 454, 68, 70, 92, 50, 132, 42, "물", "벌레", ["수포","저수"]),
new Pokemon("0778", "0778", "따라큐", 476, 55, 90, 80, 50, 105, 96, "고스트", "페어리", ["탈"]),
new Pokemon("0785", "0785", "카푸꼬꼬꼭", 570,70, 115, 85, 95, 75, 130, "전기", "페어리", ["일렉트릭메이커","텔레파시"]),
new Pokemon("0793", "0793", "텅비드", 570, 109, 53, 47, 127, 131, 103, "바위", "독", ["비스트부스트"]),
new Pokemon("0795", "0795", "페로코체", 570,71, 137, 37, 137, 37, 151, "벌레", "격투", ["비스트부스트"]),
new Pokemon("0797", "0797", "철화구야", 570, 97, 101, 103, 107, 101, 61, "강철", "비행", ["비스트부스트"]),
new Pokemon("0804", "0804", "아고용", 540, 73, 73, 73, 127 ,73, 121, "독", "드래곤", ["비스트부스트"]),
new Pokemon("0809", "0809", "멜메탈", 600, 135, 143, 143, 80, 65, 34, "강철", null, { legendary: true }, ["철주먹"]),
new Pokemon("0812", "0812", "고릴타", 530, 100, 125, 90, 60, 70, 85, "풀", null, ["그래스메이커","심록"]),
new Pokemon("0815", "0815", "에이스번", 530, 80, 116, 75, 65, 75, 119, "불꽃", null, ["리베로","맹화"]),
new Pokemon("0823", "0823", "아머까오", 495, 98, 87, 105, 53, 85, 67, "비행", "강철", ["미러아머","프레셔","긴장감"]),
new Pokemon("0861", "0861", "오롱털", 510, 95, 120, 65, 95, 75, 60, "악", "페어리", ["짓궂은마음","통찰","픽포켓"]),
new Pokemon("0882", "0882", "어래곤", 505, 90, 90, 100, 70, 80, 75, "물", "드래곤", ["옹골찬턱","저수","모래헤치기"]),
new Pokemon("0887", "0887", "드래펄트", 600, 88, 120, 75, 100, 75, 142, "드래곤", "고스트", ["클리어바디","틈새포착","저주받은바디"]),
new Pokemon("0888", "0888", "자시안", 720, 92, 170, 115, 80, 115, 148, "페어리", "강철", { legendary: true }, ["불요의검"]),
new Pokemon("0889", "0889", "자마젠타", 720, 92, 130, 145, 80, 145, 128, "격투", "강철", { legendary: true }, ["불굴의방패"]),
new Pokemon("0890", "0890", "무한다이노", 690, 140, 85, 95, 145, 95, 130, "독", "드래곤", { legendary: true }, ["프레셔"]),
new Pokemon("0892", "0892-a", "악라오스", 550, 100, 130, 100, 63, 60, 97, "격투", "악", ["보이지않는주먹"]),
new Pokemon("0892", "0892-b", "물라오스", 550, 100, 130, 100, 63, 60, 97, "격투", "물", ["보이지않는주먹"]),
new Pokemon("0895", "0895", "레지드래고", 580, 200, 100, 50, 100, 50, 80, "드래곤", null, ["용의턱"]),
new Pokemon("0898", "0898-a", "백마렉스", 680, 100, 165, 150, 85, 130, 50, "에스퍼", "얼음", { legendary: true }, ["혼연일체(백)"]),
new Pokemon("0898", "0898-b", "흑마렉스", 680, 100, 85, 80, 165, 100, 150, "에스퍼", "고스트", { legendary: true }, ["혼연일체(흑)"]),
new Pokemon("0900", "0900", "사마자르", 500, 70, 135, 95, 45, 70, 85, "벌레", "바위", ["예리함","벌레의알림","우격다짐"]),
new Pokemon("0901", "0901-a", "다투곰", 550, 130, 140, 105, 45, 80, 50, "땅", "노말", ["근성","방탄","긴장감"]),
new Pokemon("0901", "0901-b", "달투곰", 555, 113, 70, 120, 135, 65, 52, "땅", "노말", ["심안"]),
new Pokemon("0902", "0902", "대쓰여너", 530, 120, 112, 65, 80, 75, 78, "물", "고스트", ["적응력","쓱쓱","틀깨기"]),
new Pokemon("0903", "0903", "포푸니크", 510, 80, 130, 60, 40, 80, 120, "격투", "독", ["곡예","프레셔","독수"]),
new Pokemon("0908", "0908", "마스카나", 530, 76, 110, 70, 81, 70, 123, "풀", "악", ["변환자재","심록"]),
new Pokemon("0970", "0970", "킬라플로르", 525, 83, 55, 90, 130, 81 ,86, "바위", "독", ["독치장","부식"]),
new Pokemon("0977", "0977", "어써러셔", 530, 150, 100, 115, 65, 65, 35, "물", null, ["천진","둔감","수의베일"]),
new Pokemon("0983", "0983", "대도각참", 550, 100, 135, 120, 60, 85, 50, "악", "강철", ["총대장","오기","프레셔"]),
new Pokemon("0987", "0987", "날개치는머리", 570, 55, 55, 55, 135, 135, 135, "고스트", "페어리", ["고대활성"]),
new Pokemon("0991", "0991", "무쇠보따리", 570, 56, 80, 114, 124, 60, 136, "얼음", "물", ["쿼크차지"]),
new Pokemon("0992", "0992", "무쇠손", 570, 154, 140, 108, 50, 68, 50, "격투", "전기", ["쿼크차지"]),
new Pokemon("1002", "1002", "파오젠", 570, 80, 120, 80, 90, 65, 135, "악", "얼음", ["재앙의검"]),
new Pokemon("1003", "1003", "딩루", 570, 155, 110, 125, 55, 80, 45, "악", "땅", ["재앙의그릇"]),
new Pokemon("1004", "1004", "위유이", 570, 55, 80, 80, 135, 120, 100, "악", "불꽃", ["재앙의구슬"]),
new Pokemon("1007", "1007", "코라이돈", 670, 100, 135, 115, 85, 100, 135, "격투", "드래곤", { legendary: true }, ["진홍빛고동"]),
new Pokemon("1008", "1008", "미라이돈", 670, 100, 85, 100, 135, 115, 135, "전기", "드래곤", { legendary: true }, ["하드론엔진"]),
new Pokemon("1018", "1018", "브리두라스", 600, 90, 105, 130, 125, 65, 85, "강철", "드래곤", ["지구력","옹골참","굳건한신념"]),



    ];
  }
  // ID로 객체 찾기
  getDataById(id) {
    return this.items.find((item) => item.id === id) || null;
  }
  getItemById(id) {
    return this.getDataById(id);
  }
}

// 싱글턴 객체 생성 (전역에서 사용 가능)
const pokemonRepository = new PokemonRepository();
export default pokemonRepository;
