import PokemonTemplate from "./PokemonTemplate";
//배틀용 포켓몬 객체
//원본(PokemonData)에서 노력치, 스킬, 지닌 도구를 설정한다
//ReadOnly, 불변값으로 Pokemon 객체가 origin으로 지니고있는다
// prettier-ignore
class SamplePokemonList {
  constructor() {
    this.items = [

new PokemonTemplate("윈디", "0059", "6V", 0, 252, 0, 0, 4, 252, "atk", "catk",
  "플레어드라이브", "신속", "아침햇살", "도깨비불", "울퉁불퉁멧", "위협", "물리막이"),

new PokemonTemplate("파르셀", "0091", "6V", 4, 252, 0, 0, 0, 252, "atk", "catk",
  "고드름침", "껍질깨기", "록블라스트", "얼음뭉치", "기합의띠", "스킬링크", "물리어태커"),

new PokemonTemplate("럭키", "0113", "5V1A", 4, 0, 252, 0, 252, 0, "cdef", "atk",
  "알낳기", "스텔스록", "전기자석파", "지구던지기", "진화의휘석", "자연회복", "특수막이"),

new PokemonTemplate("갸라도스", "0130", "6V", 244, 0, 252, 0, 0, 12, "def", "catk",
  "폭포오르기", "지진", "도발", "전기자석파", "울퉁불퉁멧", "위협", "물리막이"),

new PokemonTemplate("썬더", "0145", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",
  "10만볼트", "열풍", "폭풍", "날개쉬기", "생명의구슬", "정전기", "특수어태커"),

new PokemonTemplate("망나뇽", "0149", "6V", 196, 252, 4, 0, 4, 52, "atk", "catk",
  "신속", "역린", "지진", "아이언헤드", "구애머리띠", "멀티스케일", "물리어태커"),

new PokemonTemplate("마릴리", "0184", "6V", 252, 252, 0, 0, 4, 0, "atk", "catk",
  "치근거리기", "아쿠아제트", "아쿠아브레이크", "탁쳐서떨구기", "돌격조끼", "천하장사", "물리어태커"),

new PokemonTemplate("블래키", "0197", "5V1A", 244, 0, 252, 0, 12, 0, "def", "atk",
  "맹독", "희망사항", "방어", "속임수", "먹다남은음식", "정신력", "물리막이"),

new PokemonTemplate("쏘콘", "0205", "4V", 252, 0, 252, 0, 4, 0, "def", "speed",
  "바디프레스", "철벽", "스텔스록", "독압정", "울퉁불퉁멧", "옹골참", "물리막이"),

new PokemonTemplate("폴리곤2", "0233", "5V1A", 4, 0, 252, 0, 252, 0, "def", "atk",
  "트라이어택", "냉동빔", "속임수", "HP회복", "진화의휘석", "트레이스", "물리막이"),

new PokemonTemplate("해피너스", "0242", "5V1A", 4, 0, 252, 0, 252, 0, "cdef", "atk",
  "알낳기", "섀도볼", "명상", "지구던지기", "먹다남은음식", "자연회복", "특수막이"),

new PokemonTemplate("칠색조", "0250", "6V", 252, 36, 76, 0, 92, 52, "atk", "catk",
  "성스러운불꽃", "브레이브버드", "지진", "HP회복", "통굽부츠", "재생력", "물리어태커"),

new PokemonTemplate("코터스", "0324", "5V1S", 252, 0, 252, 0, 4, 0, "def", "speed",
  "화염방사", "스텔스록", "클리어스모그", "하품", "뜨거운바위", "가뭄", "서포터"),

new PokemonTemplate("가이오가", "0382", "5V1A", 0, 0, 4, 252, 0, 252, "catk", "atk",
  "해수스파우팅", "근원의파동", "번개", "냉동빔", "구애스카프", "잔비", "특수어태커"),
  
new PokemonTemplate("찌르호크", "0398", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "브레이브버드", "이판사판태클", "유턴", "전광석화", "구애머리띠", "이판사판", "물리어태커"),

new PokemonTemplate("한카리아스", "0445", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "지진", "스케일샷", "아이언헤드", "스텔스록", "속임수주사위", "까칠한피부", "물리어태커"),

new PokemonTemplate("히드런", "0485", "5V1A", 212, 188, 0, 108, 0, 0, "def", "atk",
  "마그마스톰", "대지의힘", "도발", "대타출동", "풍선", "타오르는불꽃", "물리어태커"),

new PokemonTemplate("크레세리아", "0488", "5V1A", 252, 0, 252, 0, 4, 0, "def", "atk",
  "달빛", "명상", "어시스트파워", "초승달춤", "울퉁불퉁멧", "부유", "물리막이"),

new PokemonTemplate("샤로다", "0497", "5V1A", 84, 0, 164, 4, 4, 252, "speed", "atk",
  "리프스톰", "뱀눈초리", "씨뿌리기", "대타출동", "먹다남은음식", "심술꾸러기", "특수어태커"),

new PokemonTemplate("히검귀", "0504", "6V", 0, 252, 4, 0, 0, 252, "speed", "catk",
 "비검천중파", "성스러운칼", "퀵턴", "기습", "구애스카프", "예리함", "물리어태커"),

new PokemonTemplate("몰드류", "0530", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "지진", "아이언헤드", "칼춤", "암석봉인", "기합의띠", "틀깨기", "물리어태커"),

new PokemonTemplate("맘복치", "0594", "6V", 4, 0, 252, 0, 252, 0, "def", "speed",
  "퀵턴", "방어", "치유소원", "희망사항", "울퉁불퉁멧", "재생력", "물리막이"),

new PokemonTemplate("전툴라", "0596", "5V1A", 4, 0, 0, 252, 0, 252, "speed", "atk",
  "끈적끈적네트", "번개", "벌레의야단법석", "전기자석파", "기합의띠", "복안", "서포터"),

new PokemonTemplate("너트령", "0598", "6V", 252, 4, 252, 0, 0, 0, "def", "catk",
  "아이언헤드", "방어", "씨뿌리기", "대타출동", "먹다남은음식", "철가시", "물리막이"),

new PokemonTemplate("샹델라", "0609", "5V1A", 0, 0, 0, 252, 4, 252, "speed", "atk",
  "화염방사", "섀도볼", "에너지볼", "트릭", "구애스카프", "타오르는불꽃", "특수어태커"),

new PokemonTemplate("삼삼드래", "0635", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",
  "용성군", "악의파동", "화염방사", "유턴", "구애스카프", "부유", "특수어태커"),

new PokemonTemplate("블랙큐레무", "0644", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "고드름침", "크로스썬더", "용의춤", "스케일샷", "속임수주사위", "테라볼티지", "물리어태커"),

new PokemonTemplate("랜드로스", "0645", "6V", 212, 4, 252, 0, 4, 36, "def", "catk",
  "지진", "유턴", "스텔스록", "암석봉인", "울퉁불퉁멧", "위협", "물리막이"),

new PokemonTemplate("파이어로", "0663", "6V", 4, 252, 0, 0, 0, 252, "atk", "catk",
  "브레이브버드", "플레어드라이브", "유턴", "날개쉬기", "구애머리띠", "질풍날개", "물리어태커"),

 new PokemonTemplate("크레베이스", "0713", "5V1S", 252, 4, 252, 0, 0, 0, "def", "cdef",
  "바디프레스", "철벽", "HP회복", "미러코트", "울퉁불퉁멧", "옹골참", "물리막이"),

new PokemonTemplate("제르네아스", "0716", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",
  "문포스", "지오컨트롤", "기합구슬", "대타출동", "파워풀허브", "페어리오라", "특수어태커"),

new PokemonTemplate("이벨타르", "0717", "6V", 0, 4, 0, 252, 0, 252, "speed", "atk",
  "데스윙", "기습", "속임수", "탁쳐서떨구기", "생명의구슬", "다크오라", "특수어태커"),

new PokemonTemplate("누리레느", "0730", "6V", 252, 0, 36, 204, 12, 4, "catk", "speed",
  "물거품아리아", "문포스", "아쿠아제트", "퀵턴", "돌격조끼", "급류", "특수어태커"),

new PokemonTemplate("깨비물거미", "0752", "6V", 252, 252, 4, 0, 0, 0, "atk", "catk",
  "끈적끈적네트", "아쿠아브레이크", "흡혈", "덤벼들기", "신비의물방울", "수포", "물리어태커"),

new PokemonTemplate("따라큐", "0778", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "야습", "칼춤", "섀도크루", "치근거리기", "생명의구슬", "탈", "물리어태커"),

new PokemonTemplate("카푸꼬꼬꼭", "0785", "5V1A", 252, 0, 4, 0, 0, 252, "speed", "atk",
  "리플렉터", "빛의장막", "볼트체인지", "도발", "빛의점토", "일렉트릭메이커", "서포터"),

new PokemonTemplate("텅비드", "0793", "5V1A", 52, 0, 28, 172, 4, 252, "speed", "atk",
  "메테오빔", "오물웨이브", "풀묶기", "10만볼트", "파워풀허브", "비스트부스트", "특수어태커"),

new PokemonTemplate("페로코체", "0795", "6V", 0, 252, 0, 0, 4, 252, "atk", "catk",
  "인파이트", "유턴", "트리플악셀", "독찌르기", "기합의띠", "비스트부스트", "물리어태커"),

new PokemonTemplate("철화구야", "0797", "5V1A", 252, 0, 252, 0, 4, 0, "def", "speed",
  "헤비봄버", "에어슬래시", "씨뿌리기", "대타출동", "먹다남은음식", "비스트부스트", "물리막이"),

new PokemonTemplate("아고용", "0804", "5V1A", 4, 0, 0, 252, 0, 252, "speed", "atk",
  "용성군", "오물웨이브", "불대문자", "유턴", "구애스카프", "비스트부스트", "특수어태커"),

new PokemonTemplate("고릴타", "0812", "6V", 252, 0, 4, 0, 252, 0, "cdef", "catk",
  "드럼어택", "그래스슬라이더", "탁쳐서떨구기", "유턴", "돌격조끼", "그래스메이커", "특수어태커"),

new PokemonTemplate("에이스번", "0815", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "화염볼", "무릎차기", "기습", "칼춤", "생명의구슬", "리베로", "물리어태커"),

new PokemonTemplate("오롱털", "0861", "6V", 252, 0, 252, 0, 0, 4, "def", "catk",
  "리플렉터", "빛의장막", "도발", "막말내뱉기", "빛의점토", "짓궂은마음", "서포터"),

new PokemonTemplate("어래곤", "0882", "6V", 4, 252, 0, 0, 0, 252, "speed", "catk",
  "아가미물기", "역린", "사이코팽", "깨물어부수기", "구애스카프", "옹골찬턱", "물리어태커"),

new PokemonTemplate("자시안", "0888", "6V", 140, 84, 4, 0, 28, 252, "speed", "catk",
  "거수참", "치근거리기", "칼춤", "인파이트", "녹슨검", "불요의검", "물리어태커"),

new PokemonTemplate("자마젠타", "0889", "6V", 252, 36, 76, 0, 92, 52, "def", "catk",
  "거수탄", "바디프레스", "철벽", "깨물어부수기", "녹슨방패", "불굴의방패", "물리막이"),

new PokemonTemplate("무한다이노", "0890", "5V1A", 0, 0, 4, 252, 0, 252, "speed", "atk",
  "다이맥스포", "오물웨이브", "화염방사", "섀도볼", "생명의구슬", "프레셔", "특수어태커"),

new PokemonTemplate("악라오스", "0891", "6V", 0, 252, 4, 0, 0, 252, "atk", "catk",
  "암흑강타", "기습", "인파이트", "칼춤", "구애머리띠", "보이지않는주먹", "물리어태커"),

new PokemonTemplate("물라오스", "0892", "6V", 124, 236, 4, 0, 4, 140, "atk", "catk",
  "수류연타", "아쿠아제트", "인파이트", "칼춤", "펀치글러브", "보이지않는주먹", "물리어태커"),

new PokemonTemplate("백마렉스", "0896", "4V", 252, 252, 4, 0, 0, 0, "atk", "speed",
  "블리자드랜스", "10만마력", "트릭룸", "칼춤", "먹다남은음식", "혼연일체(백)", "물리어태커"),

new PokemonTemplate("흑마렉스", "0897", "5V1A", 0, 0, 4, 252, 0, 252, "catk", "atk",
  "아스트랄비트", "사이코쇼크", "트릭", "나쁜음모", "구애스카프", "혼연일체(흑)", "특수어태커"),

new PokemonTemplate("다투곰", "0901", "6V", 204, 252, 28, 0, 20, 4, "atk", "catk",
  "지진", "객기", "개척하기", "칼춤", "화염구슬", "근성", "물리어태커"),

new PokemonTemplate("달투곰", "0901-2", "5V1A", 212, 0, 4, 196, 4, 92, "catk", "atk",
  "블러드문", "하이퍼보이스", "대지의힘", "진공파", "돌격조끼", "심안", "특수어태커"),

new PokemonTemplate("대쓰여너", "0902", "6V", 4, 252, 0, 0, 0, 252, "atk", "catk",
  "웨이브태클", "아쿠아제트", "성묘", "퀵턴", "생명의구슬", "적응력", "물리어태커"),

new PokemonTemplate("포푸니크", "0903", "6V", 0, 252, 4, 0, 0, 252, "speed", "catk",
  "페이탈클로", "인파이트", "유턴", "지옥찌르기", "하양허브", "곡예", "물리어태커"),

new PokemonTemplate("킬라플로르", "0970", "5V1A", 0, 0, 0, 252, 4, 252, "speed", "atk",
  "킬러스핀", "파워젬", "스텔스록", "독압정", "울퉁불퉁멧", "독치장", "서포터"),

new PokemonTemplate("어써러셔", "0977", "6V", 252, 0, 252, 4, 0, 0, "def", "catk",
  "땅가르기", "방어", "하품", "웨이브태클", "먹다남은음식", "천진", "물리막이"),

new PokemonTemplate("대도각참", "0983", "6V", 252, 252, 4, 0, 0, 0, "atk", "catk",
  "도각참", "기습", "아이언헤드", "칼춤", "검은안경", "총대장", "물리어태커"),

new PokemonTemplate("날개치는머리", "0987", "5V1A", 132, 0, 4, 236, 4, 132, "speed", "atk",
  "문포스", "병상첨병", "전기자석파", "도발", "부스트에너지", "고대활성", "특수어태커"),

new PokemonTemplate("파오젠", "1002", "6V", 0, 188, 68, 0, 0, 252, "speed", "catk",
  "고드름떨구기", "기습", "성스러운칼", "얼음뭉치", "기합의띠", "재앙의검", "물리어태커"),

new PokemonTemplate("딩루", "1003", "6V", 252, 0, 252, 0, 4, 0, "def", "catk",
  "지진", "카타스트로피", "스텔스록", "날려버리기", "자뭉열매", "재앙의그릇", "물리막이"),

new PokemonTemplate("위유이", "1004", "5V1A", 4, 0, 0, 252, 0, 252, "catk", "atk",
  "불대문자", "화염방사", "오버히트", "악의파동", "구애스카프", "재앙의구슬", "특수어태커"),

new PokemonTemplate("코라이돈", "1007", "6V", 0, 252, 4, 0, 0, 252, "speed", "catk",
  "플레어드라이브", "인파이트", "유턴", "역린", "구애스카프", "진홍빛고동", "물리어태커"),

new PokemonTemplate("미라이돈", "1008", "5V1A", 44, 0, 4, 244, 12, 204, "catk", "atk",
  "라이트닝드라이브", "볼트체인지", "용성군", "매지컬샤인", "구애안경", "하드론엔진", "특수어태커"),

new PokemonTemplate("마스카나", "1010", "6V", 0, 252, 4, 0, 0, 252, "speed", "catk",
  "트릭플라워", "기습", "트리플악셀", "유턴", "구애스카프", "변환자재", "물리어태커"),

new PokemonTemplate("브리두라스", "1018", "5V1A", 252, 0, 0, 252, 4, 0, "catk", "atk",
  "용성군", "러스트캐논", "울부짖기", "스텔스록", "자뭉열매", "지구력", "특수어태커"),

  // 체력 공격력 방어력 특공 특방 스피드
    ];
  }
  // ID로 객체 찾기
  getItemById(id) {
    return this.items.find((item) => item.id === id) || null;
  }
}

// 싱글턴 객체 생성 (전역에서 사용 가능)
const sampleList = new SamplePokemonList();
export default sampleList;
